Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/Max3263x/DeviceCode/drivers/intc/Max326_IRQs.cpp
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// The Samraksh Company
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <tinyhal.h>
#include <mxc_config.h>
#include <string.h>
//#include <nvic_table.h>
#include "Max326_Intc.h"

////////////////////////////////////////////////////////////////////////////////

#undef  TRACE_ALWAYS

#define TRACE_ALWAYS               0x00000001

#undef  DEBUG_TRACE
#define DEBUG_TRACE (TRACE_ALWAYS)

////////////////////////////////////////////////////////////////////////////////

//#define DEBUG_DOTNOW_ISR

#if defined(ADS_LINKER_BUG__NOT_ALL_UNUSED_VARIABLES_ARE_REMOVED)
#pragma arm section rwdata = "s_IsrTable_MAX326"
#endif

#define DEFINE_IRQ(index, priority) { priority, { NULL, (void*)(size_t)index } }

static IRQ_VECTORING s_IsrTable[];
#define s_IsrTable __isr_vector;

MAX326_AITC_Driver::IRQ_VECTORING __section(rwdata) MAX326_AITC_Driver::s_IsrTable[] =
{
	DEFINE_IRQ(MAX326_AITC::c_IRQ_INDEX_WWDG			, MAX326_AITC::c_IRQ_Priority_15),
    DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_PVD          ,MAX326_AITC::c_IRQ_Priority_15  ),
    DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_TAMPER            ,MAX326_AITC::c_IRQ_Priority_15  ),
    DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_RTC     ,MAX326_AITC::c_IRQ_Priority_1  ),
    DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_FLASH     ,MAX326_AITC::c_IRQ_Priority_15  ),
    DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_RCC    ,MAX326_AITC::c_IRQ_Priority_10  ),
    DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_EXTI0   ,MAX326_AITC::c_IRQ_Priority_10  ),
    DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_EXTI1        ,MAX326_AITC::c_IRQ_Priority_10  ),
    DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_EXTI2        ,MAX326_AITC::c_IRQ_Priority_10  ),
    DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_EXTI3        ,MAX326_AITC::c_IRQ_Priority_10  ),
    DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_EXTI4        ,MAX326_AITC::c_IRQ_Priority_10  ),
    DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_DMA_CHANNEL1       ,MAX326_AITC::c_IRQ_Priority_14  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_DMA_CHANNEL2       ,MAX326_AITC::c_IRQ_Priority_14  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_DMA_CHANNEL3       ,MAX326_AITC::c_IRQ_Priority_15  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_DMA_CHANNEL4       ,MAX326_AITC::c_IRQ_Priority_15  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_DMA_CHANNEL5       ,MAX326_AITC::c_IRQ_Priority_15  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_DMA_CHANNEL6       ,MAX326_AITC::c_IRQ_Priority_15  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_DMA_CHANNEL7       ,MAX326_AITC::c_IRQ_Priority_15  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_ADC1_2       ,MAX326_AITC::c_IRQ_Priority_3  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_USB_HP_CAN_TX       ,MAX326_AITC::c_IRQ_Priority_15  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_USB_LP_CAN_RX0       ,MAX326_AITC::c_IRQ_Priority_15  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_CAN_RX1       ,MAX326_AITC::c_IRQ_Priority_15 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_CAN_SCE       ,MAX326_AITC::c_IRQ_Priority_15 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_EXTI9_5       ,MAX326_AITC::c_IRQ_Priority_10 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_TIM1_BRK_TIM9       ,MAX326_AITC::c_IRQ_Priority_15 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_TIM1_UP_TIM10       ,MAX326_AITC::c_IRQ_Priority_15 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_TIM1_TRG_COM_TIM11       ,MAX326_AITC::c_IRQ_Priority_15 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_TIM1_CC       ,MAX326_AITC::c_IRQ_Priority_1 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_TIM2       ,MAX326_AITC::c_IRQ_Priority_2 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_TIM3       ,MAX326_AITC::c_IRQ_Priority_5 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_TIM4       ,MAX326_AITC::c_IRQ_Priority_3 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_I2C1_EV       ,MAX326_AITC::c_IRQ_Priority_10 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_I2C1_ER       ,MAX326_AITC::c_IRQ_Priority_10 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_I2C2_EV       ,MAX326_AITC::c_IRQ_Priority_10 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_I2C2_ER       ,MAX326_AITC::c_IRQ_Priority_10 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_SPI1       ,MAX326_AITC::c_IRQ_Priority_15 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_SPI2       ,MAX326_AITC::c_IRQ_Priority_15 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_USART1       ,MAX326_AITC::c_IRQ_Priority_0 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_USART2       ,MAX326_AITC::c_IRQ_Priority_5 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_USART3       ,MAX326_AITC::c_IRQ_Priority_15 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_EXTI15_10       ,MAX326_AITC::c_IRQ_Priority_10 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_RTCAlarm       ,MAX326_AITC::c_IRQ_Priority_1 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_USBWakeUp       ,MAX326_AITC::c_IRQ_Priority_15 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_TIM8_BRK_TIM12       ,MAX326_AITC::c_IRQ_Priority_15 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_TIM8_UP       ,MAX326_AITC::c_IRQ_Priority_14 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_TIM8_TRG_COM       ,MAX326_AITC::c_IRQ_Priority_15 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_TIM8_CC       ,MAX326_AITC::c_IRQ_Priority_15 ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_ADC3       ,MAX326_AITC::c_IRQ_Priority_15 ),
    DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_FSMC          ,MAX326_AITC::c_IRQ_Priority_15  ),
    DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_SDIO          ,MAX326_AITC::c_IRQ_Priority_5  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_TIM5          ,MAX326_AITC::c_IRQ_Priority_15  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_SPI3          ,MAX326_AITC::c_IRQ_Priority_15  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_USART4          ,MAX326_AITC::c_IRQ_Priority_15  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_USART5          ,MAX326_AITC::c_IRQ_Priority_15  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_TIM6          ,MAX326_AITC::c_IRQ_Priority_15  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_TIM7          ,MAX326_AITC::c_IRQ_Priority_15  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_DMA2_Channel1          ,MAX326_AITC::c_IRQ_Priority_14  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_DMA2_Channel2          ,MAX326_AITC::c_IRQ_Priority_14  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_DMA2_Channel3          ,MAX326_AITC::c_IRQ_Priority_14  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_DMA2_Channel4_5          ,MAX326_AITC::c_IRQ_Priority_14  ),
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_PendSV          ,MAX326_AITC::c_IRQ_Priority_15 ), //Mukundan
	DEFINE_IRQ( MAX326_AITC::c_IRQ_INDEX_SVCall        ,MAX326_AITC::c_IRQ_Priority_5  ),
};

#undef DEFINE_IRQ

